## CHAPTER 5
# Getting Started with pandas
---
## Index and Indexing

In [2]:
%pylab inline

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
plt.style.use('ggplot')

Populating the interactive namespace from numpy and matplotlib

In [7]:
pd.Index([1,2,3])
pd.Index(['a','b','c'])

Index(['a', 'b', 'c'], dtype='object')

In [28]:
s=pd.Series(list('python'))
display(s, s.index)

0    p
1    y
2    t
3    h
4    o
5    n
dtype: object

RangeIndex(start=0, stop=6, step=1)

In [29]:
s=pd.Series(range(3), index=['a','b','c'])
display(s, s.index)

idx = s.index
idx[0], idx[-1], idx[:2]

a    0
b    1
c    2
dtype: int32

Index(['a', 'b', 'c'], dtype='object')

('a', 'c', Index(['a', 'b'], dtype='object'))

In [30]:
#s.index[0]=99 # Error!! index is immutable
s.index=[11,12,13]
s

11    0
12    1
13    2
dtype: int32

In [4]:
s = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
s

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [6]:
s2 = s.reindex(list('abcde'),fill_value=0)
s2

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [7]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
    columns=['Ohio', 'Texas', 'California'])
display(frame)

frame2 = frame.reindex(list('abcd'))
frame2

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [36]:
frame.reindex(columns=['Texas','Utah','California'])

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [43]:
frame.reindex(index=['a','b','c','d'],columns=['Texas','Utah','California'])

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [46]:
df = pd.DataFrame(np.arange(9).reshape(3,3))
df2 = df.reindex(range(4),method='ffill')
df2

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8
3  6  7  8

In [8]:
frame.loc[['a','b','c','d'],['Ohio','California']]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Ohio  California
a   0.0         2.0
b   NaN         NaN
c   3.0         5.0
d   6.0         8.0

In [9]:
frame.loc['a':'c','Ohio':'Texas']

   Ohio  Texas
a     0      1
c     3      4

In [65]:
frame.iloc[1] # frame.loc['a']
frame.iloc[::-1]
frame[[False,True,False]]

   Ohio  Texas  California
c     3      4           5

In [66]:
frame[frame.Texas%2==1]

   Ohio  Texas  California
a     0      1           2
d     6      7           8

In [67]:
df=frame.copy()
df[df<5]=0
df

   Ohio  Texas  California
a     0      0           0
c     0      0           5
d     6      7           8